# pandas

In [86]:
import pandas as pd

In [87]:
a=pd.Series()
print(a)
type(a)

Series([], dtype: object)

pandas.core.series.Series

In [88]:
l=[1,2,3,4]
df=pd.Series(l,index=[101,102,103,104])

In [89]:
df

101    1
102    2
103    3
104    4
dtype: int64

In [90]:
marks=[10,20,90,50,100]
data=pd.Series(marks)

In [91]:
data

0     10
1     20
2     90
3     50
4    100
dtype: int64

In [92]:
data.describe()

count      5.000000
mean      54.000000
std       40.373258
min       10.000000
25%       20.000000
50%       50.000000
75%       90.000000
max      100.000000
dtype: float64

In [93]:
data.describe().dtype

dtype('float64')

In [94]:
res={1:'one',2:'two',3:'three'}

In [95]:
dict1=pd.Series(res)

In [96]:
dict1

1      one
2      two
3    three
dtype: object

In [97]:
dict1[1]

'one'

In [98]:
data

0     10
1     20
2     90
3     50
4    100
dtype: int64

In [99]:
data.describe()

count      5.000000
mean      54.000000
std       40.373258
min       10.000000
25%       20.000000
50%       50.000000
75%       90.000000
max      100.000000
dtype: float64

In [100]:
data.info()

<class 'pandas.core.series.Series'>
RangeIndex: 5 entries, 0 to 4
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      int64
dtypes: int64(1)
memory usage: 168.0 bytes

In [101]:
dict1.info()

<class 'pandas.core.series.Series'>
Index: 3 entries, 1 to 3
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

In [102]:
dict2={'U18AJ21S0297':'Anupam','U18AJ21S0298':'LAKSHMI','U18AJ21S0299':'SIDHARTHA','U18AJ21S0300':'SHUBH','U18AJ21S0301':'RAM','U18AJ21S0302':'SOHAN','U18AJ21S0303':'ROHAN'}

In [103]:
dict2

{'U18AJ21S0297': 'Anupam',
 'U18AJ21S0298': 'LAKSHMI',
 'U18AJ21S0299': 'SIDHARTHA',
 'U18AJ21S0300': 'SHUBH',
 'U18AJ21S0301': 'RAM',
 'U18AJ21S0302': 'SOHAN',
 'U18AJ21S0303': 'ROHAN'}

In [104]:
hel=pd.Series(dict2,index=['U18AJ21S0300','U18AJ21S0297','U18AJ21S0301'])
# in pandas we can STORE THE MULTIPLE  DATATYPE BUT IN NUMPY THE DATATYPE SHOULD BE SIMILAR

In [105]:
hel

U18AJ21S0300     SHUBH
U18AJ21S0297    Anupam
U18AJ21S0301       RAM
dtype: object

In [106]:
data=pd.Series(dict2)

In [107]:
data

U18AJ21S0297       Anupam
U18AJ21S0298      LAKSHMI
U18AJ21S0299    SIDHARTHA
U18AJ21S0300        SHUBH
U18AJ21S0301          RAM
U18AJ21S0302        SOHAN
U18AJ21S0303        ROHAN
dtype: object

In [108]:
data.info()

<class 'pandas.core.series.Series'>
Index: 7 entries, U18AJ21S0297 to U18AJ21S0303
Series name: None
Non-Null Count  Dtype
--------------  -----
7 non-null      object
dtypes: object(1)
memory usage: 412.0+ bytes

In [109]:
data.describe()

count          7
unique         7
top       Anupam
freq           1
dtype: object

In [110]:
data

U18AJ21S0297       Anupam
U18AJ21S0298      LAKSHMI
U18AJ21S0299    SIDHARTHA
U18AJ21S0300        SHUBH
U18AJ21S0301          RAM
U18AJ21S0302        SOHAN
U18AJ21S0303        ROHAN
dtype: object

In [111]:
data.loc['U18AJ21S0297'] #label name will be argument

'Anupam'

In [112]:
data.iloc[1] # index value will be argument which is integer

'LAKSHMI'

In [113]:
marks

[10, 20, 90, 50, 100]

In [114]:
type(marks)

list

In [115]:
marks=pd.Series(marks)

In [116]:
marks

0     10
1     20
2     90
3     50
4    100
dtype: int64

In [117]:
marks.iloc[3:]

3     50
4    100
dtype: int64

In [118]:
marks

0     10
1     20
2     90
3     50
4    100
dtype: int64

In [119]:
marks.loc[(marks>=20) & (marks<90)]

1    20
3    50
dtype: int64

In [120]:
list1=[[1,2,3],[4,5,6],[6,7,8]]

In [121]:
list1

[[1, 2, 3], [4, 5, 6], [6, 7, 8]]

In [122]:
list1=pd.DataFrame(list1)

In [123]:
list1

   0  1  2
0  1  2  3
1  4  5  6
2  6  7  8

In [124]:
list1.iloc[1:,1:]

   1  2
1  5  6
2  7  8

In [125]:
marks

0     10
1     20
2     90
3     50
4    100
dtype: int64

In [126]:
student={"name":["shubh","anupam","sandesh","himanshu","sabnam","risabh"],
         "Math_marks":[80,90,100,99,98,97]
         }
df=pd.DataFrame(student,index=[201,202,203,204,205,206])

In [127]:
df

         name  Math_marks
201     shubh          80
202    anupam          90
203   sandesh         100
204  himanshu          99
205    sabnam          98
206    risabh          97

In [128]:
df.head(2)

       name  Math_marks
201   shubh          80
202  anupam          90

In [129]:
df

         name  Math_marks
201     shubh          80
202    anupam          90
203   sandesh         100
204  himanshu          99
205    sabnam          98
206    risabh          97

In [130]:
df["name"]

201       shubh
202      anupam
203     sandesh
204    himanshu
205      sabnam
206      risabh
Name: name, dtype: object

In [131]:
df.loc[2:,['name','Math_marks']]

         name  Math_marks
201     shubh          80
202    anupam          90
203   sandesh         100
204  himanshu          99
205    sabnam          98
206    risabh          97

In [132]:
df.describe()

       Math_marks
count    6.000000
mean    94.000000
std      7.720104
min     80.000000
25%     91.750000
50%     97.500000
75%     98.750000
max    100.000000

In [133]:
df.dtypes

name          object
Math_marks     int64
dtype: object

In [134]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 201 to 206
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        6 non-null      object
 1   Math_marks  6 non-null      int64
dtypes: int64(1), object(1)
memory usage: 316.0+ bytes

In [135]:
df

         name  Math_marks
201     shubh          80
202    anupam          90
203   sandesh         100
204  himanshu          99
205    sabnam          98
206    risabh          97

In [136]:
df["evs_marks"]=pd.Series([90,99,98,97,96,95],index=[201,202,203,204,205,206])

In [137]:
df

         name  Math_marks  evs_marks
201     shubh          80         90
202    anupam          90         99
203   sandesh         100         98
204  himanshu          99         97
205    sabnam          98         96
206    risabh          97         95

In [138]:
df["kannada_marks"]=pd.Series([90,99,98,97,96,95],index=[201,202,203,204,205,206])

In [139]:
df

         name  Math_marks  evs_marks  kannada_marks
201     shubh          80         90             90
202    anupam          90         99             99
203   sandesh         100         98             98
204  himanshu          99         97             97
205    sabnam          98         96             96
206    risabh          97         95             95

In [140]:
df["total"]=df['Math_marks']+df['evs_marks']+df['kannada_marks']

In [141]:
df

         name  Math_marks  evs_marks  kannada_marks  total
201     shubh          80         90             90    260
202    anupam          90         99             99    288
203   sandesh         100         98             98    296
204  himanshu          99         97             97    293
205    sabnam          98         96             96    290
206    risabh          97         95             95    287

In [142]:
df['average']=df['total']/3

In [143]:
df

         name  Math_marks  evs_marks  kannada_marks  total    average
201     shubh          80         90             90    260  86.666667
202    anupam          90         99             99    288  96.000000
203   sandesh         100         98             98    296  98.666667
204  himanshu          99         97             97    293  97.666667
205    sabnam          98         96             96    290  96.666667
206    risabh          97         95             95    287  95.666667

In [144]:
del df['average']

In [145]:
df

         name  Math_marks  evs_marks  kannada_marks  total
201     shubh          80         90             90    260
202    anupam          90         99             99    288
203   sandesh         100         98             98    296
204  himanshu          99         97             97    293
205    sabnam          98         96             96    290
206    risabh          97         95             95    287

In [146]:
df

         name  Math_marks  evs_marks  kannada_marks  total
201     shubh          80         90             90    260
202    anupam          90         99             99    288
203   sandesh         100         98             98    296
204  himanshu          99         97             97    293
205    sabnam          98         96             96    290
206    risabh          97         95             95    287

In [147]:
# str magic method

In [148]:
df.describe()

       Math_marks  evs_marks  kannada_marks       total
count    6.000000   6.000000       6.000000    6.000000
mean    94.000000  95.833333      95.833333  285.666667
std      7.720104   3.188521       3.188521   13.002564
min     80.000000  90.000000      90.000000  260.000000
25%     91.750000  95.250000      95.250000  287.250000
50%     97.500000  96.500000      96.500000  289.000000
75%     98.750000  97.750000      97.750000  292.250000
max    100.000000  99.000000      99.000000  296.000000

In [149]:
d={
    "name":['rohan','mohan','sohan','sita','gita']
   }

In [150]:
df=pd.DataFrame(d)

In [151]:
df

    name
0  rohan
1  mohan
2  sohan
3   sita
4   gita

In [152]:
import numpy as np

In [153]:
df['hindi']=np.random.randint(1,50,5)

In [154]:
df

    name  hindi
0  rohan     36
1  mohan     30
2  sohan     22
3   sita     41
4   gita     10

In [155]:
df['kannada']=np.random.randint(1,50,5)
df['english']=np.random.randint(1,50,5)
df['c']=np.random.randint(1,50,5)
df['c++']=np.random.randint(1,50,5)
df['java']=np.random.randint(1,50,5)

In [156]:
df

    name  hindi  kannada  english   c  c++  java
0  rohan     36       47        7  26   17    48
1  mohan     30       27       19  15   35    30
2  sohan     22       36       15  13   21    32
3   sita     41       19       31  40   19    34
4   gita     10       11       27  34   37    28

In [157]:
df['total']=df['hindi']+df['kannada']+df['english']+df['c']+df['c++']+df['java']

In [158]:
df

    name  hindi  kannada  english   c  c++  java  total
0  rohan     36       47        7  26   17    48    181
1  mohan     30       27       19  15   35    30    156
2  sohan     22       36       15  13   21    32    139
3   sita     41       19       31  40   19    34    184
4   gita     10       11       27  34   37    28    147

In [159]:
df['percentage']=(df['total']/300)*100

In [160]:
df

    name  hindi  kannada  english   c  c++  java  total  percentage
0  rohan     36       47        7  26   17    48    181   60.333333
1  mohan     30       27       19  15   35    30    156   52.000000
2  sohan     22       36       15  13   21    32    139   46.333333
3   sita     41       19       31  40   19    34    184   61.333333
4   gita     10       11       27  34   37    28    147   49.000000

In [161]:
df['failed_subjects']=(df.iloc[:,1:6]<18).sum(axis=1)

In [162]:
df

,name,hindi,kannada,english,c,c++,java,total,percentage,failed_subjects
0,rohan,36,47,7,26,17,48,181,60.333333,2
1,mohan,30,27,19,15,35,30,156,52.000000,1
2,sohan,22,36,15,13,21,32,139,46.333333,2
3,sita,41,19,31,40,19,34,184,61.333333,0
4,gita,10,11,27,34,37,28,147,49.000000,2

In [163]:
df['fail/pass']="pass"

In [164]:
df

,name,hindi,kannada,english,c,c++,java,total,percentage,failed_subjects,fail/pass
0,rohan,36,47,7,26,17,48,181,60.333333,2,pass
1,mohan,30,27,19,15,35,30,156,52.000000,1,pass
2,sohan,22,36,15,13,21,32,139,46.333333,2,pass
3,sita,41,19,31,40,19,34,184,61.333333,0,pass
4,gita,10,11,27,34,37,28,147,49.000000,2,pass

In [165]:
#df.loc[(df.failed_subjects<3)]="fail"

In [166]:
df

,name,hindi,kannada,english,c,c++,java,total,percentage,failed_subjects,fail/pass
0,rohan,36,47,7,26,17,48,181,60.333333,2,pass
1,mohan,30,27,19,15,35,30,156,52.000000,1,pass
2,sohan,22,36,15,13,21,32,139,46.333333,2,pass
3,sita,41,19,31,40,19,34,184,61.333333,0,pass
4,gita,10,11,27,34,37,28,147,49.000000,2,pass

In [167]:
# df.loc[df['failed subjects']>=4,'fail/pass']='fail'

In [168]:
df

,name,hindi,kannada,english,c,c++,java,total,percentage,failed_subjects,fail/pass
0,rohan,36,47,7,26,17,48,181,60.333333,2,pass
1,mohan,30,27,19,15,35,30,156,52.000000,1,pass
2,sohan,22,36,15,13,21,32,139,46.333333,2,pass
3,sita,41,19,31,40,19,34,184,61.333333,0,pass
4,gita,10,11,27,34,37,28,147,49.000000,2,pass

In [169]:
# df["result"]=df["failed subjects"].apply(lambda x:'Pass' if x<4 else 'Fail')

In [170]:
del df['fail/pass']

In [171]:
df

,name,hindi,kannada,english,c,c++,java,total,percentage,failed_subjects
0,rohan,36,47,7,26,17,48,181,60.333333,2
1,mohan,30,27,19,15,35,30,156,52.000000,1
2,sohan,22,36,15,13,21,32,139,46.333333,2
3,sita,41,19,31,40,19,34,184,61.333333,0
4,gita,10,11,27,34,37,28,147,49.000000,2

In [172]:
df

,name,hindi,kannada,english,c,c++,java,total,percentage,failed_subjects
0,rohan,36,47,7,26,17,48,181,60.333333,2
1,mohan,30,27,19,15,35,30,156,52.000000,1
2,sohan,22,36,15,13,21,32,139,46.333333,2
3,sita,41,19,31,40,19,34,184,61.333333,0
4,gita,10,11,27,34,37,28,147,49.000000,2

In [173]:
data=pd.read_csv("Iris.csv")

In [174]:
data.head(2)

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,NaN,1.4,0.2,NaN

In [175]:
data.drop('Unnamed: 0',axis=1,inplace=True)

In [176]:
data

    SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm         Species
0             5.1           3.5           1.4           0.2     Iris-setosa
1             4.9           NaN           1.4           0.2             NaN
2             4.7           3.2           1.3           0.2     Iris-setosa
3              ??           3.1           1.5           0.2     Iris-setosa
4               5           3.6           ###           0.2     Iris-setosa
..            ...           ...           ...           ...             ...
145           6.7           3.0           5.2           2.3  Iris-virginica
146           6.3           2.5             5           1.9  Iris-virginica
147           6.5           3.0           5.2           2.0  Iris-virginica
148           6.2           3.4           5.4           2.3  Iris-virginica
149           5.9           3.0           5.1           1.8  Iris-virginica

[150 rows x 5 columns]

In [177]:
data.head(2)

  SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm      Species
0           5.1           3.5           1.4           0.2  Iris-setosa
1           4.9           NaN           1.4           0.2          NaN

In [178]:
data.isnull().any()

SepalLengthCm    False
SepalWidthCm      True
PetalLengthCm     True
PetalWidthCm     False
Species           True
dtype: bool

In [179]:
data.dtypes

SepalLengthCm     object
SepalWidthCm     float64
PetalLengthCm     object
PetalWidthCm     float64
Species           object
dtype: object

In [180]:
data.head()

  SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm      Species
0           5.1           3.5           1.4           0.2  Iris-setosa
1           4.9           NaN           1.4           0.2          NaN
2           4.7           3.2           1.3           0.2  Iris-setosa
3            ??           3.1           1.5           0.2  Iris-setosa
4             5           3.6           ###           0.2  Iris-setosa

In [181]:
data.isnull()

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  Species
0            False         False          False         False    False
1            False          True          False         False     True
2            False         False          False         False    False
3            False         False          False         False    False
4            False         False          False         False    False
..             ...           ...            ...           ...      ...
145          False         False          False         False    False
146          False         False          False         False    False
147          False         False          False         False    False
148          False         False          False         False    False
149          False         False          False         False    False

[150 rows x 5 columns]

In [182]:
data.isnull().any()

SepalLengthCm    False
SepalWidthCm      True
PetalLengthCm     True
PetalWidthCm     False
Species           True
dtype: bool

In [183]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SepalLengthCm  150 non-null    object
 1   SepalWidthCm   149 non-null    float64
 2   PetalLengthCm  149 non-null    object
 3   PetalWidthCm   150 non-null    float64
 4   Species        149 non-null    object
dtypes: float64(2), object(3)
memory usage: 6.0+ KB

In [184]:
data.head(5)

  SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm      Species
0           5.1           3.5           1.4           0.2  Iris-setosa
1           4.9           NaN           1.4           0.2          NaN
2           4.7           3.2           1.3           0.2  Iris-setosa
3            ??           3.1           1.5           0.2  Iris-setosa
4             5           3.6           ###           0.2  Iris-setosa

In [187]:
data['Species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [186]:
data.dropna(subset=['Species'],inplace=True)

In [188]:
data.dropna(subset=['SepalLengthCm'],inplace=True)

In [189]:
data.head()

  SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm      Species
0           5.1           3.5           1.4           0.2  Iris-setosa
2           4.7           3.2           1.3           0.2  Iris-setosa
3            ??           3.1           1.5           0.2  Iris-setosa
4             5           3.6           ###           0.2  Iris-setosa
5           5.4           3.9           NaN           0.4  Iris-setosa

In [192]:
data.loc[data['SepalLengthCm']=="??",'SepalLengthCm']=np.nan

In [193]:
data.dropna(subset=['SepalLengthCm'],inplace=True)

In [194]:
data.head()

  SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm      Species
0           5.1           3.5           1.4           0.2  Iris-setosa
2           4.7           3.2           1.3           0.2  Iris-setosa
4             5           3.6           ###           0.2  Iris-setosa
5           5.4           3.9           NaN           0.4  Iris-setosa
6           4.6           3.4           1.4           0.3  Iris-setosa

In [204]:
data.head(5)

  SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm      Species
0           5.1           3.5           1.4           0.2  Iris-setosa
2           4.7           3.2           1.3           0.2  Iris-setosa
4             5           3.6           ###           0.2  Iris-setosa
5           5.4           3.9           NaN           0.4  Iris-setosa
6           4.6           3.4           1.4           0.3  Iris-setosa

In [218]:
data.reset_index(inplace=True)

In [219]:
data.loc[:,'Species']

0      2
1      2
2      2
3      2
4      2
      ..
143    1
144    1
145    1
146    1
147    1
Name: Species, Length: 148, dtype: object

In [199]:
data.Species.value_counts()

Species
Iris-versicolor    50
Iris-virginica     50
Iris-setosa        48
Name: count, dtype: int64

In [212]:
data.loc[:,'Species']=data.loc[:,'Species'].replace({'Iris-versicolor':0,'Iris-virginica':1,'Iris-setosa':2})

C:\Users\shubh\AppData\Local\Temp\ipykernel_6964\2727804620.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data.loc[:,'Species']=data.loc[:,'Species'].replace({'Iris-versicolor':0,'Iris-virginica':1,'Iris-setosa':2})

In [213]:
data

    SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm Species
0             5.1           3.5           1.4           0.2       2
2             4.7           3.2           1.3           0.2       2
4               5           3.6           ###           0.2       2
5             5.4           3.9           NaN           0.4       2
6             4.6           3.4           1.4           0.3       2
..            ...           ...           ...           ...     ...
145           6.7           3.0           5.2           2.3       1
146           6.3           2.5             5           1.9       1
147           6.5           3.0           5.2           2.0       1
148           6.2           3.4           5.4           2.3       1
149           5.9           3.0           5.1           1.8       1

[148 rows x 5 columns]

In [220]:
data.loc[data.loc[:,'Species']==2]

    index SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm Species
0       0           5.1           3.5           1.4           0.2       2
1       2           4.7           3.2           1.3           0.2       2
2       4             5           3.6           ###           0.2       2
3       5           5.4           3.9           NaN           0.4       2
4       6           4.6           3.4           1.4           0.3       2
5       7             5           3.4           1.5           0.2       2
6       8           4.4           2.9           1.4           0.2       2
7       9           4.9           3.1           1.5           0.1       2
8      10           5.4           3.7           1.5           0.2       2
9      11           4.8           3.4           1.6           0.2       2
10     12           4.8           3.0           1.4           0.1       2
11     13           4.3           3.0           1.1           0.1       2
12     14           5.8           4.0           1.2           0.2       2
13     15           5.7           4.4           1.5           0.4       2
14     16           5.4           3.9           1.3           0.4       2
15     17           5.1           3.5           1.4           0.3       2
16     18           5.7           3.8           1.7           0.3       2
17     19           5.1           3.8           1.5           0.3       2
18     20           5.4           3.4           1.7           0.2       2
19     21           5.1           3.7           1.5           0.4       2
20     22           4.6           3.6             1           0.2       2
21     23           5.1           3.3           1.7           0.5       2
22     24           4.8           3.4           1.9           0.2       2
23     25             5           3.0           1.6           0.2       2
24     26             5           3.4           1.6           0.4       2
25     27           5.2           3.5           1.5           0.2       2
26     28           5.2           3.4           1.4           0.2       2
27     29           4.7           3.2           1.6           0.2       2
28     30           4.8           3.1           1.6           0.2       2
29     31           5.4           3.4           1.5           0.4       2
30     32           5.2           4.1           1.5           0.1       2
31     33           5.5           4.2           1.4           0.2       2
32     34           4.9           3.1           1.5           0.1       2
33     35             5           3.2           1.2           0.2       2
34     36           5.5           3.5           1.3           0.2       2
35     37           4.9           3.1           1.5           0.1       2
36     38           4.4           3.0           1.3           0.2       2
37     39           5.1           3.4           1.5           0.2       2
38     40             5           3.5           1.3           0.3       2
39     41           4.5           2.3           1.3           0.3       2
40     42           4.4           3.2           1.3           0.2       2
41     43             5           3.5           1.6           0.6       2
42     44           5.1           3.8           1.9           0.4       2
43     45           4.8           3.0           1.4           0.3       2
44     46           5.1           3.8           1.6           0.2       2
45     47           4.6           3.2           1.4           0.2       2
46     48           5.3           3.7           1.5           0.2       2
47     49             5           3.3           1.4           0.2       2

In [217]:
data['Species'].value_counts()

Species
0    50
1    50
2    48
Name: count, dtype: int64

In [209]:
data.iloc[:,0:2]

    SepalLengthCm  SepalWidthCm
0             5.1           3.5
2             4.7           3.2
4               5           3.6
5             5.4           3.9
6             4.6           3.4
..            ...           ...
145           6.7           3.0
146           6.3           2.5
147           6.5           3.0
148           6.2           3.4
149           5.9           3.0

[148 rows x 2 columns]